Revit 2027 API
FabricationConnectorInfo.IsDoubleWallConnectorLocked Property
 Fabrication double wall connector lock.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDoubleWallConnectorLocked { get; set; }
Public Property IsDoubleWallConnectorLocked As Boolean
	Get
	Set
public:
property bool IsDoubleWallConnectorLocked {
	bool get ();
	void set (bool value);
}
member IsDoubleWallConnectorLocked : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  No double wall connector available. -or- When setting this property: the connector cannot be modified on an owned fabrication part. -or- When setting this property: the connector is already connected. -or- When setting this property: the fabrication part is connected to more than one item.
Remarks
 If set this prevents the connector value being overridden by the fabrication specification.
See Also
Reference
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace